In [1]:
import pandas as pd 
import numpy as np

### EKSIK VERI

In [2]:
sozlukVerisi = {"Istanbul ": [30, 29,np.nan],
                "Ankara": [20,np.nan,25],
                "Izmir": [40,39,38],}
# DataFrame oluşturma
havaDurumudf = pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumudf

   Istanbul   Ankara  Izmir
0       30.0    20.0     40
1       29.0     NaN     39
2        NaN    25.0     38

In [4]:
# Eksik veri ile calismak nan verileri silmek
havaDurumudf.dropna()  # satır bazında eksik verileri siler

   Istanbul   Ankara  Izmir
0       30.0    20.0     40

In [5]:
havaDurumudf.dropna(axis=1)  # sütun bazında eksik verileri siler

   Izmir
0     40
1     39
2     38

In [6]:
yeniVeri = {"Istanbul ": [30, 29,np.nan],
                "Ankara": [20,np.nan,25],
                "Izmir": [40,39,38],
                "Bursa": [35, np.nan, np.nan],}
# DataFrame oluşturma
yenihavaDurumudf = pd.DataFrame(yeniVeri)

In [7]:
yenihavaDurumudf

   Istanbul   Ankara  Izmir  Bursa
0       30.0    20.0     40   35.0
1       29.0     NaN     39    NaN
2        NaN    25.0     38    NaN

In [8]:
yenihavaDurumudf.fillna(0)  # eksik verileri 0 ile doldurur

   Istanbul   Ankara  Izmir  Bursa
0       30.0    20.0     40   35.0
1       29.0     0.0     39    0.0
2        0.0    25.0     38    0.0

In [9]:
yenihavaDurumudf.dropna(axis=1, thresh=2)  # en az 2 nan değer içeren sütunları siler

   Istanbul   Ankara  Izmir
0       30.0    20.0     40
1       29.0     NaN     39
2        NaN    25.0     38

In [16]:
yenihavaDurumudf.dropna(axis=1, thresh=1)

   Istanbul   Ankara  Izmir  Bursa
0       30.0    20.0     40   35.0
1       29.0     NaN     39    NaN
2        NaN    25.0     38    NaN

In [ ]:
yenihavaDurumudf.fillna(20) # eksik verileri 20 ile doldurur

   Istanbul   Ankara  Izmir  Bursa
0       30.0    20.0     40   35.0
1       29.0    20.0     39   20.0
2       20.0    25.0     38   20.0